import React from 'react'

/**
 * Иконка аудитории
 * @param {object} props Дополнительные свойства
 * @returns {JSX.Element} Иконка аудитории
 */
function AudienceIcon(props) {
  return (
    <svg {...props} viewBox='0 0 24 24' fill='currentColor' xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M23.4 18.8H20.4V6.25434C20.4 5.23209 19.5926 4.39996 18.6 4.39996H14.4V6.79996H18V21.2H23.4C23.7315
        21.2 24 20.9315 24 20.6V19.4C24 19.0685 23.7315 18.8 23.4 18.8ZM11.709 2.03784L4.509 3.90309C3.97463
        4.04146 3.6 4.53871 3.6 5.10946V18.8H0.6C0.2685 18.8 0 19.0685 0 19.4V20.6C0 20.9315 0.2685 21.2 0.6
        21.2H13.2V3.24421C13.2 2.43496 12.4665 1.84134 11.709 2.03784V2.03784ZM9.9 12.8C9.40313 12.8 9 12.2626
        9 11.6C9 10.9373 9.40313 10.4 9.9 10.4C10.3969 10.4 10.8 10.9373 10.8 11.6C10.8 12.2626 10.3969
        12.8 9.9 12.8Z'
      />
    </svg>
  )
}

export default AudienceIcon
