import React from 'react'

/**
 * Иконка Revers
 * @param {object} props Дополнительные свойства
 * @returns {JSX.Element} Иконка Revers
 */
function ReversIcon(props) {
  return (
    <svg {...props} width='24' height='24' viewBox='0 0 24 24' fill='currentColor' xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M2 8.56258V7.93758C2 7.41981 2.41973 7.00008 2.9375 7.00008H17V5.12508C17 4.29043 18.0117 3.87344 18.6004
        4.46215L21.7254 7.58715C22.0915 7.95328 22.0915 8.54688 21.7254 8.91297L18.6004 12.038C18.0139 12.6244 17
        12.2132 17 11.3751V9.50008H2.9375C2.41973 9.50008 2 9.08035 2 8.56258ZM21.0625 14.5001H7V12.6251C7 11.7925
        5.98977 11.372 5.39957 11.9622L2.27457 15.0872C1.90848 15.4533 1.90848 16.0469 2.27457 16.413L5.39957
        19.538C5.9866 20.125 7 19.7125 7 18.8751V17.0001H21.0625C21.5803 17.0001 22 16.5804 22 16.0626V15.4376C22
        14.9198 21.5803 14.5001 21.0625 14.5001Z'
      />
    </svg>
  )
}

export default ReversIcon
