import React from 'react'

/**
 * Иконка самолётика
 * @param {object} props Дополнительные свойства
 * @returns {JSX.Element} Иконка самолётика
 */
function SendIcon(props) {
  return (
    <svg {...props} width='22' height='22' viewBox='0 0 22 22' fill='currentColor' xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M21.5443 10.2859L1.11621 0.857523C0.790936 0.709812 0.402802 0.79781 0.176522 1.07752C-0.0513293 1.35722
        -0.0591863 1.75479 0.157666 2.04235L6.87536 10.9993L0.157666 19.9562C-0.0591863 20.2438 -0.0513293 20.6429
        0.174951 20.921C0.327376 21.1112 0.555227 21.2133 0.786222 21.2133C0.89779 21.2133 1.00936 21.1897 1.11464
        21.141L21.5427 11.7127C21.8224 11.5838 22 11.3057 22 10.9993C22 10.6929 21.8224 10.4147 21.5443 10.2859Z'
      />
    </svg>
  )
}

export default SendIcon
